---
kind: other
id: Properties.T:Autodesk.Revit.DB.BuiltInFailures.CurveByPointFailures
source: html/d1bc4a83-16b1-9c7f-8572-99122d0e9a11.htm
---
# BuiltInFailures.CurveByPointFailures Properties

Unable to generate valid curve geometry from the driving points. The line by points will be dissolved.